relocsrl/scintix-p4/examples/rm-cmp4_eth_iperf_u0/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_example.csv"
CONFIG_ETHERNET_PHY_KSZ80XX=y
CONFIG_ETHERNET_PHY_ADDR=0
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_ETH_IRAM_OPTIMIZATION=y
CONFIG_LIBC_NEWLIB=y
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=7168
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FATFS_LFN_NONE=y
CONFIG_FATFS_USE_DYN_BUFFERS=n
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_CMAC_C=n
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_IPERF_DEF_TCP_TX_BUFFER_LEN=16384
CONFIG_IPERF_DEF_TCP_RX_BUFFER_LEN=16384
CONFIG_IPERF_DEF_UDP_RX_BUFFER_LEN=16384
